MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512L.atdf
      <value-group caption="AN12 Pin Scan Selection bits" name="AD1CSSL__CSSL12">
         <value caption="Select AN12 for input scan; CSSL12 = AN12" name="" value="0x1" />
         <value caption="Skip AN12 for input scan; CSSL12 = AN12" name="" value="0x0" />
      </value-group>
      <value-group caption="AN13 Pin Scan Selection bits" name="AD1CSSL__CSSL13">
         <value caption="Select AN13 for input scan; CSSL13 = AN13" name="" value="0x1" />
         <value caption="Skip AN13 for input scan; CSSL13 = AN13" name="" value="0x0" />
      </value-group>
      <value-group caption="AN14 Pin Scan Selection bits" name="AD1CSSL__CSSL14">
         <value caption="Select AN14 for input scan; CSSL14 = AN14" name="" value="0x1" />
         <value caption="Skip AN14 for input scan; CSSL14 = AN14" name="" value="0x0" />
      </value-group>
      <value-group caption="AN15 Pin Scan Selection bits" name="AD1CSSL__CSSL15">
         <value caption="Select AN15 for input scan; CSSL15 = AN15" name="" value="0x1" />
         <value caption="Skip AN15 for input scan; CSSL15 = AN15" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00747" name="BMX" version="1">
      <register-group name="BMX">
         <register caption="Bus Matrix Configuration Register" name="BMXCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Bus Matrix Arbitration Mode bits" mask="0x00000007" name="BMXARB" values="BMXCON__BMXARB" />
            <bitfield caption="CPU Instruction or Data Access from Data RAM Wait State bit" mask="0x00000040" name="BMXWSDRM" values="BMXCON__BMXWSDRM" />
            <bitfield caption="Bus Error from CPU Instruction Access bit" mask="0x00010000" name="BMXERRIS" values="BMXCON__BMXERRIS" />
            <bitfield caption="Bus Error from CPU Data Access bit" mask="0x00020000" name="BMXERRDS" values="BMXCON__BMXERRDS" />
            <bitfield caption="Bus Error from DMA bit" mask="0x00040000" name="BMXERRDMA" values="BMXCON__BMXERRDMA" />
            <bitfield caption="Enable Bus Error from ICD Debug Unit bit" mask="0x00080000" name="BMXERRICD" values="BMXCON__BMXERRICD" />
            <bitfield caption="Enable Bus Error from IXI bit" mask="0x00100000" name="BMXERRIXI" values="BMXCON__BMXERRIXI" />
            <bitfield caption="BMX PFM Cacheability for DMA Accesses bit" mask="0x04000000" name="BMXCHEDMA" values="BMXCON__BMXCHEDMA" />
         </register>
         <register caption="Data RAM Kernel Program Base Address Register" name="BMXDKPBA" offset="0x10" rw="RW" size="4">
            <bitfield caption="DRM Kernel Program Base Address bits (bits 15-10, bits 9-0 are read only)" mask="0xFFFFFFFF" name="BMXDKPBA" values="BMXDKPBA__BMXDKPBA" />
         </register>
         <register caption="Data RAM User Data Base Address Register" name="BMXDUDBA" offset="0x20" rw="RW" size="4">
            <bitfield caption="DRM User Data Base Address bits (bits 15-10, bits 9-0 are read only)" mask="0xFFFFFFFF" name="BMXDUDBA" values="BMXDUDBA__BMXDUDBA" />
         </register>
         <register caption="Data RAM User Program Base Address Register" name="BMXDUPBA" offset="0x30" rw="RW" size="4">
            <bitfield caption="DRM User Program Base Address bits (bits 15-10, bits 9-0 are read only)" mask="0xFFFFFFFF" name="BMXDUPBA" values="BMXDUPBA__BMXDUPBA" />
         </register>
         <register caption="Data RAM Size Register" name="BMXDRMSZ" offset="0x40" rw="R" size="4">
            <bitfield caption="Data RAM Memory Size bits" mask="0xFFFFFFFF" name="BMXDRMSZ" values="BMXDRMSZ__BMXDRMSZ" />
         </register>
         <register caption="Program Flash (PFM) User Program Base Address Register" name="BMXPUPBA" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="BMXPUPBA" />
         </register>
         <register caption="Program Flash (PFM) Size Register" name="BMXPFMSZ" offset="0x60" rw="R" size="4">
            <bitfield caption="Program Flash Memory (PFM) Size bits" mask="0xFFFFFFFF" name="BMXPFMSZ" values="BMXPFMSZ__BMXPFMSZ" />
         </register>
         <register caption="Boot Flash (IFM) Size Register" name="BMXBOOTSZ" offset="0x70" rw="R" size="4">
            <bitfield caption="Boot Flash Memory Size bits" mask="0xFFFFFFFF" name="BMXBOOTSZ" values="BMXBOOTSZ__BMXBOOTSZ" />
         </register>
      </register-group>
      <value-group caption="Bus Matrix Arbitration Mode bits" name="BMXCON__BMXARB">
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x7" />
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x6" />
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x5" />
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x4" />
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x3" />
         <value caption="Arbitration Mode 2" name="" value="0x2" />
         <value caption="Arbitration Mode 1 (default)" name="" value="0x1" />
         <value caption="Arbitration Mode 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Instruction or Data Access from Data RAM Wait State bit" name="BMXCON__BMXWSDRM">
         <value caption="Data RAM accesses from CPU have one wait state for address setup" name="" value="0x1" />
         <value caption="Data RAM accesses from CPU have zero wait states for address setup" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error from CPU Instruction Access bit" name="BMXCON__BMXERRIS">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from CPU instruction access" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from CPU instruction access" name="" value="0x0" />
      </value-group>
