MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512L.atdf
      <value-group caption="Bus Error from CPU Data Access bit" name="BMXCON__BMXERRDS">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from CPU data access" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from CPU data access" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error from DMA bit" name="BMXCON__BMXERRDMA">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from DMA" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from DMA" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Bus Error from ICD Debug Unit bit" name="BMXCON__BMXERRICD">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from ICD" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from ICD" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Bus Error from IXI bit" name="BMXCON__BMXERRIXI">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from IXI shared bus" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from IXI shared bus" name="" value="0x0" />
      </value-group>
      <value-group caption="BMX PFM Cacheability for DMA Accesses bit" name="BMXCON__BMXCHEDMA">
         <value caption="Enable program Flash memory (data) cacheability for DMA accesses (requires cache to have data caching enabled)" name="" value="0x1" />
         <value caption="Disable program Flash memory (data) cacheability for DMA accesses(hits are still read from the cache" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM Kernel Program Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDKPBA__BMXDKPBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM User Data Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDUDBA__BMXDUDBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM User Program Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDUPBA__BMXDUPBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="Data RAM Memory Size bits" name="BMXDRMSZ__BMXDRMSZ">
         <value caption="Device has 16 KB RAM" name="" value="0x4000" />
         <value caption="Device has 32 KB RAM" name="" value="0x8000" />
         <value caption="Device has 64 KB RAM" name="" value="0x10000" />
         <value caption="Device has 128 KB RAM" name="" value="0x20000" />
      </value-group>
      <value-group caption="Program Flash Memory (PFM) Size bits" name="BMXPFMSZ__BMXPFMSZ">
         <value caption="Device has 64 KB Flash" name="" value="0x10000" />
         <value caption="Device has 128 KB Flash" name="" value="0x20000" />
         <value caption="Device has 256 KB Flash" name="" value="0x40000" />
         <value caption="Device has 512 KB Flash" name="" value="0x80000" />
      </value-group>
      <value-group caption="Boot Flash Memory Size bits" name="BMXBOOTSZ__BMXBOOTSZ">
         <value caption="Device has 12 KB Boot Flash" name="" value="0x3000" />
      </value-group>
   </module>
   <module caption="" id="01152" name="CAN" version="1">
      <register-group name="CAN">
         <register caption="CAN Module Control Register" name="C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C1CON__DNCNT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C1CON__CANBUSY" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="CAN On bit" mask="0x00008000" name="ON" values="C1CON__ON" />
            <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00100000" name="CANCAP" values="C1CON__CANCAP" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C1CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C1CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C1CON__ABAT" />
         </register>
         <register caption="CAN Module Control Register" name="C2CON" offset="0x1000" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C2CON__DNCNT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C2CON__CANBUSY" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="CAN On bit" mask="0x00008000" name="ON" values="C2CON__ON" />
            <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00100000" name="CANCAP" values="C2CON__CANCAP" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C2CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C2CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C2CON__ABAT" />
         </register>
         <register caption="CAN Baud Rate Configuration Register" name="C1CFG" offset="0x10" rw="RW" size="4">
            <bitfield caption="Baud Rate Prescaler bits" mask="0x0000003F" name="BRP" values="C1CFG__BRP" />
            <bitfield caption="Synchronization Jump Width bits" mask="0x000000C0" name="SJW" values="C1CFG__SJW" />
            <bitfield caption="Propagation Time Segment bits" mask="0x00000700" name="PRSEG" values="C1CFG__PRSEG" />
            <bitfield caption="Phase Buffer Segment 1 bits" mask="0x00003800" name="SEG1PH" values="C1CFG__SEG1PH" />
            <bitfield caption="Sample of the CAN Bus Line bit" mask="0x00004000" name="SAM" values="C1CFG__SAM" />
            <bitfield caption="Phase Segment 2 Time Select bit" mask="0x00008000" name="SEG2PHTS" values="C1CFG__SEG2PHTS" />
            <bitfield caption="Phase Buffer Segment 2 bits" mask="0x00070000" name="SEG2PH" values="C1CFG__SEG2PH" />
            <bitfield caption="CAN Bus Line Filter Enable bit" mask="0x00400000" name="WAKFIL" values="C1CFG__WAKFIL" />
         </register>
