MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512L.atdf
      <value-group caption="Overflow Interrupt Enable bit" name="C2FIFOINT26__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1" />
         <value caption="Interrupt disabled for overflow event" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C2FIFOINT26__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C2FIFOINT26__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C2FIFOINT26__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Transmit Priority bits" name="C1FIFOCON27__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x3" />
         <value caption="High Intermediate Message Priority" name="" value="0x2" />
         <value caption="Low Intermediate Message Priority" name="" value="0x1" />
         <value caption="Lowest Message Priority" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="C1FIFOCON27__RTREN">
         <value caption="When a remote transmit is received, TXREQ will be set" name="" value="0x1" />
         <value caption="When a remote transmit is received, TXREQ will be unaffected" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Send Request" name="C1FIFOCON27__TXREQ">
         <value caption="(TXEN is 1) Request sending a message. The bit will automatically clear when all the messages queued in the FIFO are successfully sent./ (TXEN is 0) This bit has no effect" name="" value="0x1" />
         <value caption="(TXEN is 1) Request a message abort / (TXEN is 0) This bit has no effect." name="" value="0x0" />
      </value-group>
      <value-group caption="Error Detected During Transmission bit" name="C1FIFOCON27__TXERR">
         <value caption="A bus error occurred while the message was being sent" name="" value="0x1" />
         <value caption="A bus error did not occur while the message was being sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Lost Arbitration bit" name="C1FIFOCON27__TXLARB">
         <value caption="Message lost arbitration while being sent" name="" value="0x1" />
         <value caption="Message did not lose arbitration while being sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Aborted bit" name="C1FIFOCON27__TXABAT">
         <value caption="Message was aborted" name="" value="0x1" />
         <value caption="Message completed successfully" name="" value="0x0" />
      </value-group>
      <value-group caption="TX/RX Buffer Selection bit" name="C1FIFOCON27__TXEN">
         <value caption="FIFO is a Transmit FIFO" name="" value="0x1" />
         <value caption="FIFO is a Receive FIFO" name="" value="0x0" />
      </value-group>
      <value-group caption="Store Message Data Only bit" name="C1FIFOCON27__DONLY">
         <value caption="(TXEN is 1) This bit is not used and has no effect. / (TXEN is 0) Only data bytes will be stored in the FIFO" name="" value="0x1" />
         <value caption="(TXEN is 1) This bit is not used and has no effect. / (TXEN is 0) Full message is stored, including identifier" name="" value="0x0" />
      </value-group>
      <value-group caption="Increment Head/Tail bit" name="C1FIFOCON27__UINC">
         <value caption="(TXEN is 1) The FIFO head will increment by a single message / (TXEN is 0) The FIFO tail will increment by a single message" name="" value="0x1" />
         <value caption="(TXEN is 1) The FIFO head will not increment by a single message / (TXEN is 0) The FIFO tail will not increment by a single message" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Reset bits" name="C1FIFOCON27__FRESET">
         <value caption="FIFO will be reset when bit is set, cleared by hardware when FIFO is reset. After setting, the user application should poll whether this bit is clear before taking any action" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Size bits" name="C1FIFOCON27__FSIZE">
         <value caption="FIFO is 32 messages deep" name="" value="0x1f" />
         <value caption="FIFO is 3 messages deep" name="" value="0x2" />
         <value caption="FIFO is 2 messages deep" name="" value="0x1" />
         <value caption="FIFO is 1 message deep" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Transmit Priority bits" name="C2FIFOCON27__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x3" />
         <value caption="High Intermediate Message Priority" name="" value="0x2" />
         <value caption="Low Intermediate Message Priority" name="" value="0x1" />
         <value caption="Lowest Message Priority" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="C2FIFOCON27__RTREN">
         <value caption="When a remote transmit is received, TXREQ will be set" name="" value="0x1" />
         <value caption="When a remote transmit is received, TXREQ will be unaffected" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Send Request" name="C2FIFOCON27__TXREQ">
         <value caption="(TXEN is 1) Request sending a message. The bit will automatically clear when all the messages queued in the FIFO are successfully sent./ (TXEN is 0) This bit has no effect" name="" value="0x1" />
         <value caption="(TXEN is 1) Request a message abort / (TXEN is 0) This bit has no effect." name="" value="0x0" />
      </value-group>
      <value-group caption="Error Detected During Transmission bit" name="C2FIFOCON27__TXERR">
         <value caption="A bus error occurred while the message was being sent" name="" value="0x1" />
         <value caption="A bus error did not occur while the message was being sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Lost Arbitration bit" name="C2FIFOCON27__TXLARB">
         <value caption="Message lost arbitration while being sent" name="" value="0x1" />
         <value caption="Message did not lose arbitration while being sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Aborted bit" name="C2FIFOCON27__TXABAT">
         <value caption="Message was aborted" name="" value="0x1" />
         <value caption="Message completed successfully" name="" value="0x0" />
      </value-group>
      <value-group caption="TX/RX Buffer Selection bit" name="C2FIFOCON27__TXEN">
         <value caption="FIFO is a Transmit FIFO" name="" value="0x1" />
         <value caption="FIFO is a Receive FIFO" name="" value="0x0" />
      </value-group>
      <value-group caption="Store Message Data Only bit" name="C2FIFOCON27__DONLY">
         <value caption="(TXEN is 1) This bit is not used and has no effect. / (TXEN is 0) Only data bytes will be stored in the FIFO" name="" value="0x1" />
         <value caption="(TXEN is 1) This bit is not used and has no effect. / (TXEN is 0) Full message is stored, including identifier" name="" value="0x0" />
      </value-group>
