MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512L.atdf
         <value caption="Interrupt 91 will abort any transfers in progress and set CHAIF flag" name="" value="0x5b" />
         <value caption="Interrupt 90 will abort any transfers in progress and set CHAIF flag" name="" value="0x5a" />
         <value caption="Interrupt 89 will abort any transfers in progress and set CHAIF flag" name="" value="0x59" />
         <value caption="Interrupt 88 will abort any transfers in progress and set CHAIF flag" name="" value="0x58" />
         <value caption="Interrupt 87 will abort any transfers in progress and set CHAIF flag" name="" value="0x57" />
         <value caption="Interrupt 86 will abort any transfers in progress and set CHAIF flag" name="" value="0x56" />
         <value caption="Interrupt 85 will abort any transfers in progress and set CHAIF flag" name="" value="0x55" />
         <value caption="Interrupt 84 will abort any transfers in progress and set CHAIF flag" name="" value="0x54" />
         <value caption="Interrupt 83 will abort any transfers in progress and set CHAIF flag" name="" value="0x53" />
         <value caption="Interrupt 82 will abort any transfers in progress and set CHAIF flag" name="" value="0x52" />
         <value caption="Interrupt 81 will abort any transfers in progress and set CHAIF flag" name="" value="0x51" />
         <value caption="Interrupt 80 will abort any transfers in progress and set CHAIF flag" name="" value="0x50" />
         <value caption="Interrupt 79 will abort any transfers in progress and set CHAIF flag" name="" value="0x4f" />
         <value caption="Interrupt 78 will abort any transfers in progress and set CHAIF flag" name="" value="0x4e" />
         <value caption="Interrupt 77 will abort any transfers in progress and set CHAIF flag" name="" value="0x4d" />
         <value caption="Interrupt 76 will abort any transfers in progress and set CHAIF flag" name="" value="0x4c" />
         <value caption="Interrupt 75 will abort any transfers in progress and set CHAIF flag" name="" value="0x4b" />
         <value caption="Interrupt 74 will abort any transfers in progress and set CHAIF flag" name="" value="0x4a" />
         <value caption="Interrupt 73 will abort any transfers in progress and set CHAIF flag" name="" value="0x49" />
         <value caption="Interrupt 72 will abort any transfers in progress and set CHAIF flag" name="" value="0x48" />
         <value caption="Interrupt 71 will abort any transfers in progress and set CHAIF flag" name="" value="0x47" />
         <value caption="Interrupt 70 will abort any transfers in progress and set CHAIF flag" name="" value="0x46" />
         <value caption="Interrupt 69 will abort any transfers in progress and set CHAIF flag" name="" value="0x45" />
         <value caption="Interrupt 68 will abort any transfers in progress and set CHAIF flag" name="" value="0x44" />
         <value caption="Interrupt 67 will abort any transfers in progress and set CHAIF flag" name="" value="0x43" />
         <value caption="Interrupt 66 will abort any transfers in progress and set CHAIF flag" name="" value="0x42" />
         <value caption="Interrupt 65 will abort any transfers in progress and set CHAIF flag" name="" value="0x41" />
         <value caption="Interrupt 64 will abort any transfers in progress and set CHAIF flag" name="" value="0x40" />
         <value caption="Interrupt 63 will abort any transfers in progress and set CHAIF flag" name="" value="0x3f" />
         <value caption="Interrupt 62 will abort any transfers in progress and set CHAIF flag" name="" value="0x3e" />
         <value caption="Interrupt 61 will abort any transfers in progress and set CHAIF flag" name="" value="0x3d" />
         <value caption="Interrupt 60 will abort any transfers in progress and set CHAIF flag" name="" value="0x3c" />
         <value caption="Interrupt 59 will abort any transfers in progress and set CHAIF flag" name="" value="0x3b" />
         <value caption="Interrupt 58 will abort any transfers in progress and set CHAIF flag" name="" value="0x3a" />
         <value caption="Interrupt 57 will abort any transfers in progress and set CHAIF flag" name="" value="0x39" />
         <value caption="Interrupt 56 will abort any transfers in progress and set CHAIF flag" name="" value="0x38" />
         <value caption="Interrupt 55 will abort any transfers in progress and set CHAIF flag" name="" value="0x37" />
         <value caption="Interrupt 54 will abort any transfers in progress and set CHAIF flag" name="" value="0x36" />
         <value caption="Interrupt 53 will abort any transfers in progress and set CHAIF flag" name="" value="0x35" />
         <value caption="Interrupt 52 will abort any transfers in progress and set CHAIF flag" name="" value="0x34" />
         <value caption="Interrupt 51 will abort any transfers in progress and set CHAIF flag" name="" value="0x33" />
         <value caption="Interrupt 50 will abort any transfers in progress and set CHAIF flag" name="" value="0x32" />
         <value caption="Interrupt 49 will abort any transfers in progress and set CHAIF flag" name="" value="0x31" />
         <value caption="Interrupt 48 will abort any transfers in progress and set CHAIF flag" name="" value="0x30" />
         <value caption="Interrupt 47 will abort any transfers in progress and set CHAIF flag" name="" value="0x2f" />
         <value caption="Interrupt 46 will abort any transfers in progress and set CHAIF flag" name="" value="0x2e" />
         <value caption="Interrupt 45 will abort any transfers in progress and set CHAIF flag" name="" value="0x2d" />
         <value caption="Interrupt 44 will abort any transfers in progress and set CHAIF flag" name="" value="0x2c" />
         <value caption="Interrupt 43 will abort any transfers in progress and set CHAIF flag" name="" value="0x2b" />
         <value caption="Interrupt 42 will abort any transfers in progress and set CHAIF flag" name="" value="0x2a" />
         <value caption="Interrupt 41 will abort any transfers in progress and set CHAIF flag" name="" value="0x29" />
         <value caption="Interrupt 40 will abort any transfers in progress and set CHAIF flag" name="" value="0x28" />
         <value caption="Interrupt 39 will abort any transfers in progress and set CHAIF flag" name="" value="0x27" />
         <value caption="Interrupt 38 will abort any transfers in progress and set CHAIF flag" name="" value="0x26" />
         <value caption="Interrupt 37 will abort any transfers in progress and set CHAIF flag" name="" value="0x25" />
         <value caption="Interrupt 36 will abort any transfers in progress and set CHAIF flag" name="" value="0x24" />
         <value caption="Interrupt 35 will abort any transfers in progress and set CHAIF flag" name="" value="0x23" />
         <value caption="Interrupt 34 will abort any transfers in progress and set CHAIF flag" name="" value="0x22" />
         <value caption="Interrupt 33 will abort any transfers in progress and set CHAIF flag" name="" value="0x21" />
         <value caption="Interrupt 32 will abort any transfers in progress and set CHAIF flag" name="" value="0x20" />
         <value caption="Interrupt 31 will abort any transfers in progress and set CHAIF flag" name="" value="0x1f" />
         <value caption="Interrupt 30 will abort any transfers in progress and set CHAIF flag" name="" value="0x1e" />
         <value caption="Interrupt 29 will abort any transfers in progress and set CHAIF flag" name="" value="0x1d" />
         <value caption="Interrupt 28 will abort any transfers in progress and set CHAIF flag" name="" value="0x1c" />
         <value caption="Interrupt 27 will abort any transfers in progress and set CHAIF flag" name="" value="0x1b" />
         <value caption="Interrupt 26 will abort any transfers in progress and set CHAIF flag" name="" value="0x1a" />
         <value caption="Interrupt 25 will abort any transfers in progress and set CHAIF flag" name="" value="0x19" />
         <value caption="Interrupt 24 will abort any transfers in progress and set CHAIF flag" name="" value="0x18" />
         <value caption="Interrupt 23 will abort any transfers in progress and set CHAIF flag" name="" value="0x17" />
         <value caption="Interrupt 22 will abort any transfers in progress and set CHAIF flag" name="" value="0x16" />
         <value caption="Interrupt 21 will abort any transfers in progress and set CHAIF flag" name="" value="0x15" />
         <value caption="Interrupt 20 will abort any transfers in progress and set CHAIF flag" name="" value="0x14" />
         <value caption="Interrupt 19 will abort any transfers in progress and set CHAIF flag" name="" value="0x13" />
         <value caption="Interrupt 18 will abort any transfers in progress and set CHAIF flag" name="" value="0x12" />
         <value caption="Interrupt 17 will abort any transfers in progress and set CHAIF flag" name="" value="0x11" />
         <value caption="Interrupt 16 will abort any transfers in progress and set CHAIF flag" name="" value="0x10" />
         <value caption="Interrupt 15 will abort any transfers in progress and set CHAIF flag" name="" value="0xf" />
         <value caption="Interrupt 14 will abort any transfers in progress and set CHAIF flag" name="" value="0xe" />
         <value caption="Interrupt 13 will abort any transfers in progress and set CHAIF flag" name="" value="0xd" />
         <value caption="Interrupt 12 will abort any transfers in progress and set CHAIF flag" name="" value="0xc" />
         <value caption="Interrupt 11 will abort any transfers in progress and set CHAIF flag" name="" value="0xb" />
         <value caption="Interrupt 10 will abort any transfers in progress and set CHAIF flag" name="" value="0xa" />
         <value caption="Interrupt 9 will abort any transfers in progress and set CHAIF flag" name="" value="0x9" />
         <value caption="Interrupt 8 will abort any transfers in progress and set CHAIF flag" name="" value="0x8" />
         <value caption="Interrupt 7 will abort any transfers in progress and set CHAIF flag" name="" value="0x7" />
         <value caption="Interrupt 6 will abort any transfers in progress and set CHAIF flag" name="" value="0x6" />
         <value caption="Interrupt 5 will abort any transfers in progress and set CHAIF flag" name="" value="0x5" />
         <value caption="Interrupt 4 will abort any transfers in progress and set CHAIF flag" name="" value="0x4" />
         <value caption="Interrupt 3 will abort any transfers in progress and set CHAIF flag" name="" value="0x3" />
         <value caption="Interrupt 2 will abort any transfers in progress and set CHAIF flag" name="" value="0x2" />
         <value caption="Interrupt 1 will abort any transfers in progress and set CHAIF flag" name="" value="0x1" />
         <value caption="Interrupt 0 will abort any transfers in progress and set CHAIF flag" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH1ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1" />
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0" />
      </value-group>
