MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512L.atdf
         <register caption="USB Endpoint 13 Control Register" name="U1EP13" offset="0x390" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP13__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP13__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP13__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP13__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP13__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 14 Control Register" name="U1EP14" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP14__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP14__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP14__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP14__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP14__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 15 Control Register" name="U1EP15" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP15__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP15__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP15__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP15__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP15__EPCONDIS" />
         </register>
      </register-group>
      <value-group caption="A-Device Vbus Change Indicator bit" name="U1OTGIR__VBUSVDIF">
         <value caption="Change on the session valid input is detected" name="" value="0x1" />
         <value caption="No change on the session valid input is detected" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Device Vbus Change Indicator bit" name="U1OTGIR__SESENDIF">
         <value caption="A change on the session end input was detected" name="" value="0x1" />
         <value caption="No change on the session end input was detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Change Indicator bit" name="U1OTGIR__SESVDIF">
         <value caption="VBUS voltage has dropped below the session end level" name="" value="0x1" />
         <value caption="Vbus voltage has not dropped below the session end level" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Activity Indicator bit" name="U1OTGIR__ACTVIF">
         <value caption="Activity on the D+, D-, ID or VBUS pins has caused the device to wake-up" name="" value="0x1" />
         <value caption="Activity has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U1OTGIR__LSTATEIF">
         <value caption="USB line state has been stable for 1millisecond" name="" value="0x1" />
         <value caption="USB line state has not been stable for 1 millisecond" name="" value="0x0" />
      </value-group>
      <value-group caption="1 Millisecond Timer bit" name="U1OTGIR__T1MSECIF">
         <value caption="1 millisecond timer has expired" name="" value="0x1" />
         <value caption="1 millisecond timer has not expired" name="" value="0x0" />
      </value-group>
      <value-group caption="ID State Change Indicator bit" name="U1OTGIR__IDIF">
         <value caption="Change in ID state is detected" name="" value="0x1" />
         <value caption="No change in ID state is detected" name="" value="0x0" />
      </value-group>
      <value-group caption="A- Vbus Valid Interrupt Enable bit" name="U1OTGIE__VBUSVDIE">
         <value caption="A-VBUS valid interrupt is enabled" name="" value="0x1" />
         <value caption="A-VBUS valid interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Session End Interrupt Enable bit" name="U1OTGIE__SESENDIE">
         <value caption="B-session end interrupt is enabled" name="" value="0x1" />
         <value caption="B-session end interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Interrupt Enable bit" name="U1OTGIE__SESVDIE">
         <value caption="Session valid interrupt is enabled" name="" value="0x1" />
         <value caption="Session valid interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Activity Interrupt Enable bit" name="U1OTGIE__ACTVIE">
         <value caption="ACTIVITY interrupt is enabled" name="" value="0x1" />
         <value caption="ACTIVITY interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Interrupt Enable bit" name="U1OTGIE__LSTATEIE">
         <value caption="Line state interrupt is enabled" name="" value="0x1" />
         <value caption="Line state interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="1 Millisecond Timer Interrupt Enable bit" name="U1OTGIE__T1MSECIE">
         <value caption="1 millisecond timer interrupt is enabled" name="" value="0x1" />
         <value caption="1 millisecond timer interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ID Interrupt Enable bit" name="U1OTGIE__IDIE">
         <value caption="ID interrupt is enabled" name="" value="0x1" />
         <value caption="ID interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="A-Device Vbus Valid Indicator bit" name="U1OTGSTAT__VBUSVD">
         <value caption="Vbus voltage is above Session Valid on the A device" name="" value="0x1" />
         <value caption="Vbus voltage is below Session Valid on the A device" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Device Session End Indicator bit" name="U1OTGSTAT__SESEND">
         <value caption="Vbus voltage is below Session Valid on the B device" name="" value="0x1" />
         <value caption="Vbus voltage is above Session Valid on the B device" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Indicator bit" name="U1OTGSTAT__SESVD">
         <value caption="Vbus voltage is above Session Valid on the A or B device" name="" value="0x1" />
         <value caption="Vbus voltage is below Session Valid on the A or B device" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U1OTGSTAT__LSTATE">
         <value caption="USB line state (U1CON(SE0) and U1CON(JSTATE)) has been stable for the previous 1 ms" name="" value="0x1" />
         <value caption="USB line state (U1CON(SE0) and U1CON(JSTATE)) has not been stable for the previous 1 ms" name="" value="0x0" />
      </value-group>
      <value-group caption="ID Pin State Indicator bit" name="U1OTGSTAT__ID">
         <value caption="No cable is attached or a Type-B cable has been plugged into the USB receptacle" name="" value="0x1" />
         <value caption="A Type-A cable has been plugged into the USB receptacle" name="" value="0x0" />
      </value-group>
      <value-group caption="VBUS Discharge Enable bit" name="U1OTGCON__VBUSDIS">
         <value caption="VBUS line is discharged through a pull-down resistor" name="" value="0x1" />
         <value caption="VBUS line is not discharged through a resistor" name="" value="0x0" />
      </value-group>
